app/controllers/api/v1/ideas_controller.rb

SELECT "ideas".* FROM "ideas" ORDER BY created_at DESC
---
def index
      @ideas = Idea.order("created_at DESC")

INSERT INTO "ideas" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2018-03-27 16:36:58.254877"], ["updated_at", "2018-03-27 16:36:58.254877"]]
---
def create
      @idea = Idea.create(idea_params)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]
UPDATE "ideas" SET "title" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["title", "asdas"], ["updated_at", "2018-03-28 13:42:34.100470"], ["id", 48]]
---
def update
  @idea = Idea.find(params[:id])
  @idea.update_attributes(idea_params)